{
  "id": "eth00024",
  "title": "ICERD Article 2 – Obligation to Eliminate Racial Discrimination",
  "titleKey": "icerdArticle2EliminateDiscrimination",
  "type": "internationalTreaty",
  "status": "proposed",
  "history": [
    {
      "changedFrom": "",
      "changedTo": "proposed",
      "changeDate": "2025-06-02"
    }
  ],
  "source": {
    "url": "https://www.ohchr.org/en/instruments-mechanisms/instruments/international-convention-elimination-all-forms-racial-discrimination",
    "publisher": "United Nations Office of the High Commissioner for Human Rights (OHCHR)",
    "retrievedDate": "2025-06-02"
  },
  "jurisdiction": "global",
  "applicability": ["racialJustice", "nonDiscrimination", "governmentPolicy"],
  "tags": ["equity", "civilRights", "antiRacism", "internationalLaw"],
  "universalPrinciples": ["equality", "justice", "antiRacism"],
  "license": "UN Treaty",
  "origin": "external",
  "contentBlocks": [
    {
      "id": "block00024a",
      "excerpt": "1. States Parties condemn racial discrimination and undertake to pursue by all appropriate means and without delay a policy of eliminating racial discrimination in all its forms and promoting understanding among all races, and, to this end: (a) Each State Party undertakes to engage in no act or practice of racial discrimination against persons, groups of persons or institutions and to ensure that all public authorities and public institutions, national and local, shall act in conformity with this obligation; (b) Each State Party undertakes not to sponsor, defend or support racial discrimination by any persons or organizations; (c) Each State Party shall take effective measures to review governmental, national and local policies, and to amend, rescind or nullify any laws and regulations which have the effect of creating or perpetuating racial discrimination wherever it exists; (d) Each State Party shall prohibit and bring to an end, by all appropriate means, including legislation as required by circumstances, racial discrimination by any persons, group or organization; (e) Each State Party undertakes to encourage, where appropriate, integrationist multiracial organizations and movements and other means of eliminating barriers between races, and to discourage anything which tends to strengthen racial division. 2. States Parties shall, when the circumstances so warrant, take, in the social, economic, cultural and other fields, special and concrete measures to ensure the adequate development and protection of certain racial groups or individuals belonging to them, for the purpose of guaranteeing them the full and equal enjoyment of human rights and fundamental freedoms. These measures shall in no case entail as a consequence the maintenance of unequal or separate rights for different racial groups after the objectives for which they were taken have been achieved.",
      "rationale": "Directs states to eliminate racial discrimination through policy, legislation, and proactive social measures. It imposes a clear ethical and legal obligation to pursue equity, dismantle systemic racism, and promote multiracial understanding.",
      "weight": 1.0,
      "notes": "Foundational text in international anti-racism law; provides actionable guidance and mandates for national governments and institutions."
    }
  ]
}